ASSSIGNMENT NO - 02

Name - ZAKEERHUSSAIN.D.K

REG.NO- 22-27-09

BRANCH - DATA SCIENCE

In [ ]:
#Importing the Libraries
import pandas as pd
import numpy as np

1.Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [ ]:
df = pd.read_csv(r"E:\2nd SEM\DSST\housingdata.csv")

In [ ]:
df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

2.Display the column names and row index in separate cells.

In [ ]:
df.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

3.a) How many numbers of “STATE” exist in the dataset.

In [ ]:

num_rows,num_columns = df.shape

print("Number of states :" , num_rows)

Number of states : 9

3.b) How many unique states exist in the dataset

In [ ]:

Unique_states = df['STATE'].nunique()

print("Number of Unique states :" , Unique_states)

Number of Unique states : 6

4.Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [ ]:


df.isnull()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

In [ ]:
df.replace('na',np.NaN, inplace=True)

5.Drop all rows with N/A,NA,na values in Num_Bedrooms

In [ ]:
df.dropna(subset = ['NUM_BEDROOMS'] , inplace = True)
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

In [ ]:
df.replace('--',np.NaN, inplace=True)
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5   NaN
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

6.Replace the NaN and String entries in Num_Bath with previous entry

In [ ]:
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors='coerce')

# convert Num_Bath column to numeric datatype
df['NUM_BATH'].fillna(method='ffill', inplace=True)

print(df)

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5   NaN
3  100004000.0           TN     321321            1       1.5   700
4          NaN           TN  589465645            3       2.0  1600
6  100007000.0        ASSAM    3222321            2       2.0   950
7  100008000.0           HP      23131            1       1.0   NaN

7.Replace the empty values in “SQ_FT” with the mean of the all entries.

In [ ]:
df['SQ_FT']= df['SQ_FT'].astype('float')

df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5     NaN
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0     NaN

In [ ]:
mean = df['SQ_FT'].mean()

df['SQ_FT'].fillna(mean, inplace=True)

df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5  1062.5
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0  1062.5

8. What is the sum of SQ_FT of all entries in the dataset.

In [ ]:
Sum_SQFT = df['SQ_FT'].sum()

Sum_SQFT

6375.0

9. Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [ ]:
df['NUM_STORE'] = 1

df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1.0,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2.0,1600.0,1
6,100007000.0,ASSAM,3222321,2,2.0,950.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

10. Create a DataFrame containing all entries of TN state only

In [ ]:
df_TN = df.loc[df.STATE=='TN',:]

df_TN

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1       1.5   700.0          1
4          NaN    TN  589465645            3       2.0  1600.0          1

14. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [ ]:
df_SQFT = df.loc[df.SQ_FT>1000,:]

df_SQFT

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2.0,1600.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

15. Create a DataFrame having only first Three columns and First Three rows

In [ ]:
df_3col_3row= df.iloc[:3,:3]


df_3col_3row

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

16. Display the state having highest average price per square foot of housing area.

In [ ]:
df['Avg_price_per_sqft']=df['PRICE'] / df['SQ_FT']

Highest_Avg_price_per_sqft = Avg_price_per_sqft.max()

Highest_Avg_price_per_sqft

368416.028125

In [ ]:
df= df.sort_values(by='Avg_price_per_sqft', ascending=False)
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE,Avg_price_per_sqft
0,NaN,TN,589465645,3,2.0,1600.0,1,368416.028125
1,100007000.0,ASSAM,3222321,2,2.0,950.0,1,3391.916842
2,100004000.0,TN,321321,1,1.5,700.0,1,459.030000
3,100001000.0,MP,321654,3,1.0,1000.0,1,321.654000
4,100008000.0,HP,23131,1,1.0,1062.5,1,21.770353
5,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1,20.070588

In [ ]:
df.reset_index(inplace=True, drop=True)

In [ ]:
df.loc[0,'STATE']

'TN'